src/cfe/Documents/ЗаказПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказПокупателя</Name>
		</Properties>
	</Document>
</MetaDataObject>

src/cfe/Enums/СпособыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СпособыДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Курьер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Самовывоз</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПунктВыдачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Почта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Documents/ЗаказПокупателя/Ext/ManagerModule.bsl
&Вместо ("ДобавитьТаблицуЗапасыВМенеджерВременныхТаблиц")
Процедура из_ДобавитьТаблицуЗапасыВМенеджерВременныхТаблиц(Знач Заказы, МенеджерВременныхТаблиц, ВключитьНоменклатуруДоставки) Экспорт
	// Исключим доставку с нулевой суммой
	Если ТипЗнч(Заказы) <> Тип("Массив") Тогда
		Заказы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Заказы);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Если МенеджерВременныхТаблиц = Неопределено Тогда
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка КАК Ссылка,
	|	ЗаказПокупателя.ОсновнойВариантКП КАК ОсновнойВариантКП
	|ПОМЕСТИТЬ ВТЗаказы
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Ссылка В(&Ссылки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПокупателяЗапасы.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ЗаказПокупателяЗапасы.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ ВТМаксНомерСтрокиЗапасы
	|ИЗ
	|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
	|ГДЕ
	|	ЗаказПокупателяЗапасы.Ссылка В(&Ссылки)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПокупателяЗапасы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПокупателяЗапасы.Ссылка КАК Ссылка,
	|	ЗаказПокупателяЗапасы.НомерСтроки КАК НомерСтроки,
	|	ЗаказПокупателяЗапасы.НомерВариантаКП КАК НомерВариантаКП,
	|	ЗаказПокупателяЗапасы.Номенклатура КАК Номенклатура,
	|	ЗаказПокупателяЗапасы.ТипНоменклатурыЗапас КАК ТипНоменклатурыЗапас,
	|	ЗаказПокупателяЗапасы.Характеристика КАК Характеристика,
	|	ЗаказПокупателяЗапасы.Партия КАК Партия,
	|	ЗаказПокупателяЗапасы.СерииНоменклатуры КАК СерииНоменклатуры,
	|	ЗаказПокупателяЗапасы.Резерв КАК Резерв,
	|	ЗаказПокупателяЗапасы.РезервОтгрузка КАК РезервОтгрузка,
	|	ЗаказПокупателяЗапасы.СтруктурнаяЕдиницаРезерв КАК СтруктурнаяЕдиницаРезерв,
	|	ЗаказПокупателяЗапасы.Ячейка КАК Ячейка,
	|	ЗаказПокупателяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателяЗапасы.ЕдиницаИзмерения ССЫЛКА Справочник.ЕдиницыИзмерения
	|			ТОГДА ВЫРАЗИТЬ(ЗаказПокупателяЗапасы.ЕдиницаИзмерения КАК Справочник.ЕдиницыИзмерения).Коэффициент
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Коэффициент,
	|	ЗаказПокупателяЗапасы.Цена КАК Цена,
	|	ЗаказПокупателяЗапасы.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	ЗаказПокупателяЗапасы.СуммаСкидкиНаценки КАК СуммаСкидкиНаценки,
	|	ЗаказПокупателяЗапасы.ПродажаПодарка КАК ПродажаПодарка,
	|	ЗаказПокупателяЗапасы.Сумма КАК Сумма,
	|	ЗаказПокупателяЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	ЗаказПокупателяЗапасы.СуммаНДС КАК СуммаНДС,
	|	ЗаказПокупателяЗапасы.Всего КАК Всего,
	|	ЗаказПокупателяЗапасы.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ЗаказПокупателяЗапасы.Спецификация КАК Спецификация,
	|	ЗаказПокупателяЗапасы.Содержание КАК Содержание,
	|	ЗаказПокупателяЗапасы.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
	|	ЗаказПокупателяЗапасы.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	|	ЗаказПокупателяЗапасы.СуммаСкидкиОплатыБонусом КАК СуммаСкидкиОплатыБонусом,
	|	ЗаказПокупателяЗапасы.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателяЗапасы.ТипНоменклатурыЗапас
	|			ТОГДА ЗаказПокупателяЗапасы.КоличествоСобрано
	|		ИНАЧЕ ЗаказПокупателяЗапасы.Количество
	|	КОНЕЦ КАК КоличествоСобрано,
	|	ВЫБОР
	|		КОГДА ФункциональнаяОпцияИспользоватьСборкуЗаказов.Значение
	|			ТОГДА ЗаказПокупателяЗапасы.Ссылка.СтатусСборки > 0
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьСборка,
	|	ЗаказПокупателяЗапасы.КлючСвязи КАК КлючСвязи,
	|	ЗаказПокупателяЗапасы.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ЗаказПокупателяЗапасы.НомерГТД КАК НомерГТД,
	|	ЗаказПокупателяЗапасы.Вес КАК Вес,
	|	ЗаказПокупателяЗапасы.Объем КАК Объем,
	|	ЗаказПокупателяЗапасы.НоменклатураНабора КАК НоменклатураНабора,
	|	ЗаказПокупателяЗапасы.ХарактеристикаНабора КАК ХарактеристикаНабора,
	|	ЗаказПокупателяЗапасы.ДоляСтоимости КАК ДоляСтоимости,
	|	ЗаказПокупателяЗапасы.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры
	|ПОМЕСТИТЬ ВТЗаказПокупателяЗапасы
	|ИЗ
	|	Документ.ЗаказПокупателя.Запасы КАК ЗаказПокупателяЗапасы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗаказы КАК Заказы
	|		ПО (Заказы.Ссылка = ЗаказПокупателяЗапасы.Ссылка)
	|			И (Заказы.ОсновнойВариантКП = ЗаказПокупателяЗапасы.НомерВариантаКП),
	|	Константа.ФункциональнаяОпцияИспользоватьСборкуЗаказов КАК ФункциональнаяОпцияИспользоватьСборкуЗаказов
	|ГДЕ
	|	НЕ ЗаказПокупателяЗапасы.ЭтоРазделитель
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка,
	|	ЕСТЬNULL(ВТМаксНомерСтрокиЗапасы.НомерСтроки, 0) + 1,
	|	Заказы.ОсновнойВариантКП,
	|	ЗаказПокупателя.НоменклатураДоставки,
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка),
	|	"""",
	|	0,
	|	0,
	|	ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка),
	|	NULL,
	|	ЗаказПокупателя.НоменклатураДоставки.ЕдиницаИзмерения,
	|	1,
	|	ЗаказПокупателя.СтоимостьДоставки,
	|	0,
	|	NULL,
	|	ЛОЖЬ,
	|	ЗаказПокупателя.СтоимостьДоставки,
	|	ЗаказПокупателя.СтавкаНДСДоставки,
	|	ЗаказПокупателя.СуммаНДСДоставки,
	|	ЗаказПокупателя.СтоимостьДоставки + ВЫБОР
	|		КОГДА ЗаказПокупателя.СуммаВключаетНДС
	|			ТОГДА 0
	|		ИНАЧЕ ЗаказПокупателя.СуммаНДСДоставки
	|	КОНЕЦ,
	|	ЗаказПокупателя.ДатаОтгрузки,
	|	ЗНАЧЕНИЕ(Справочник.Спецификации.ПустаяСсылка),
	|	"""",
	|	0,
	|	0,
	|	0,
	|	1,
	|	1,
	|	ЛОЖЬ,
	|	0,
	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка),
	|	0,
	|	0,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|	0,
	|	NULL
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗаказы КАК Заказы
	|		ПО (Заказы.Ссылка = ЗаказПокупателя.Ссылка)
	|			И (ЗаказПокупателя.НоменклатураДоставки <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|			И (&ВключитьНоменклатуруДоставки)
	|			И (ЗаказПокупателя.СпособДоставки <> ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.ПустаяСсылка))
	|			И (ЗаказПокупателя.СпособДоставки <> ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.Самовывоз))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТМаксНомерСтрокиЗапасы КАК ВТМаксНомерСтрокиЗапасы
	|		ПО (ВТМаксНомерСтрокиЗапасы.Ссылка = ЗаказПокупателя.Ссылка)
	|ГДЕ
	|	ЗаказПокупателя.СтоимостьДоставки > 0";
	
	Запрос.УстановитьПараметр("Ссылки", Заказы);
	Запрос.УстановитьПараметр("ВключитьНоменклатуруДоставки", ВключитьНоменклатуруДоставки);
	Запрос.Выполнить();
	
КонецПроцедуры
